import os
import random

region = {'Баткен': 'Баткен', 'Кадамжай': 'Кадамжай', 'Лейлек': 'Исфана', 'Аксы': 'Кербен',
          'Ала-Бука': 'Ала-Бука', 'Базар-Коргон': 'Базар-Коргон', 'Ноокен': 'Массы', 'Сузак': 'Сузак',
          'Тогуз-Торо': 'Казарман', 'Токтогул': 'Токтогул', 'Чаткал': 'Каныш-Кыя', 'Ак-Суу': ' Теплоключенка',
          'Жети-Огуз': 'Кызыл-Суу', 'Ыссык-Кол': 'Чолпон-Ата', 'Тон': 'Боконбаева', 'Тюп': 'Тюп',
          'Ак-талаа': 'Баетово', 'Жумгал': 'Чаек', 'Кочкор': 'Кочкорка', 'Нарын': 'Нарын',
          'Алай': 'Гульча', 'Араван': 'Араван', 'Кара-Кульджа': 'Кара-Кульджа', 'Ноокат': 'Ноокат',
          'Узген': 'Узген', 'Чон-Алай': 'Дароот-Коргон', 'Бакай-Атa': 'Бакай-Атa', 'Кара-Буурa': 'Кызыл-Адыр',
          'Манас': ' Покровка', 'Талас': 'Талас', 'Аламудун': 'Лебединовка', 'Жайыл': 'Кара-Балта', 'Кемин': 'Кемин',
          'Москва': 'Беловодское', 'Панфилов': 'Каинды', 'Сокулук': 'Сокулук', 'Чуй': 'Токмок', 'Ыссык-Ата': 'Кант',
          'Ат-Баши': 'Ат-Баши', 'Кара-Суу': 'Кара-Суу'}

bilet = open(r'C:\Users\Пользователь\Desktop\Ekzamen kg\bilet.txt','w')
bilet.write('Аты-жону:\nДатасы:\n\n\n')
rayon = list(region.keys())
random.shuffle(rayon)
for i in range(len(rayon)):
    bilet.write('\n           #%s  %s районунун райондук борбурун атаныз?\n\n'%(i+1,rayon[i]))
    tuura = region[rayon[i]]
    kata = list(region.values())
    kata.remove(tuura)
    kata = random.sample(kata,3)
    variant = kata + [tuura]
    random.shuffle(variant)
    for k in range(4):
        bilet.write(' '*25+'%s %s\n'%('АБВГ'[k],variant[k]))
        
    
bilet.close()

